app/controllers/turnos_controller.rb

  def index
    @turnos = Turno.all
---
SELECT "turnos".* FROM "turnos"

  def create
    @turno = Turno.new(turno_params)

    respond_to do |format|
      if @turno.save
---
INSERT INTO "turnos" ("alumno", "comentario", "evaluacion", "fecha", "hora", "numero", "texto", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_turno
      @turno = Turno.find(params[:id])
---
SELECT  "turnos".* FROM "turnos" WHERE "turnos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]